Autodesk.Revit.DB.ExternallyTaggedNonBRep.#ctor(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.GeometryObject)
Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with
a particular GeometryObject.
externalId:
The Id of the input geometry object.
geometry:
The externally tagged geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
geometry cannot be used with an ExternallyTaggedGeometry.
-or-
geometry must not be a Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022